// import React from 'react';
// import './Buttons.scss'; // Импортируем файл стилей для этого компонента

// const Buttons = () => {
//   // Функция для создания массива из 15 кнопок
//   const renderButtons = () => {
//     const buttons = []; // Создаем пустой массив для хранения кнопок
//     for (let i = 1; i <= 15; i++) { // Цикл от 1 до 15 для создания 15 кнопок
//       buttons.push( // Добавляем кнопку в массив
//         <li key={i} className='buttonItem'> {/* Каждый элемент списка <li> имеет уникальный ключ */}
//           <button className='button'> {/* Создаем кнопку внутри элемента списка */}
//             Кнопка {i} {/* Текст кнопки, который показывает ее номер */}
//           </button>
//         </li>
//       );
//     }
//     return buttons; // Возвращаем массив кнопок
//   };

//   return (
//     <ul className='buttonList'> {/* Оборачиваем все кнопки в <ul> для создания списка */}
//       {renderButtons()} {/* Вызываем функцию renderButtons для рендеринга кнопок */}
//     </ul>
//   );
// };

// export default Buttons; // Экспортируем компонент для использования в других частях приложения





import React from 'react';
import './Buttons.scss'; // Импортируем файл стилей для этого компонента

const Buttons = () => {
  // Массив с текстом для кнопок
  const buttonTexts = [
    "Знищення тарганів", "Знищення клопів","Знищення кліщів", "Зніщення вошей", "Знищення бліх", "Знищення ос,бдзжіл",
    "Знищення попелиці", "Знищнення довгоносиків", "Знищення шкіроїдів", "Знищення комарів", "Знищення короїдів",
    "Знищення молі",  "Знищення мух", "Знищення мурах", 
  ];

  // Функция для создания массива кнопок с разным текстом
  const renderButtons = () => {
    return buttonTexts.map((text, index) => (
      <li key={index} className='buttonItem'> {/* Каждый элемент списка <li> имеет уникальный ключ */}
        <button className='button'> {/* Создаем кнопку внутри элемента списка */}
          {text} {/* Текст кнопки, переданный через props */}
        </button>
      </li>
    ));
  };

  return (
    <ul className='buttonList'> {/* Оборачиваем все кнопки в <ul> для создания списка */}
      {renderButtons()} {/* Вызываем функцию renderButtons для рендеринга кнопок */}
    </ul>
  );
};

export default Buttons; // Экспортируем компонент для использования в других частях приложения
