

import React from 'react';
import './PagesDisinsection.scss';

const PagesDisinsection = ({ currentLanguage }) => {
  const translateObj = {
    PagesDisinsection: {
      title: {
        ru: "Дезинсекция",
        ua: 'Дезінсекція'
      },
      text: {
        ru: `Дезинсекция (dés insectum) - один из видов санитарной обработки, направленный на
             полное уничтожение насекомых, переносящих инфекции, с помощью химических средств:
             генераторов горячего или холодного тумана. Санитарная служба СЭС помогает
             уничтожать клопов, проводить обработку от тараканов. Служба дезинсекции использует
             современное оборудование, которое проводится профессиональными мастерами с минимальным стажем 5 лет.
             Мы предоставляем гарантию на все работы на пищевых, складских, жилых объектах.
             Мы работаем без выходных и перерывов, все работы по дезинсекции
             проводятся круглосуточно, в назначенное вами время, с использованием препаратов IV класса
             малонебезопасных веществ (безопасных как для людей, так и для животных).`,
        ua: `Дезінсекція (dés insectum) - один із видів санітарної обробки, спрямований на
             повне знищення комах, що переносять інфекції, за допомогою хімічних засобів: 
             генераторів гарячого або холодного туману. Санітарна служба СЕС допомагає 
             знищувати клопів, проводити обробку від тарганів. Служба дезінсекції використовує 
             сучасне обладнання, що проводиться професійними майстрами, з мінімальним стажем 5 років.
             Надаємо гарантію на всі роботи на харчових, складських, житлових об'єктах.
             Ми працюємо без вихідних та перерв, всі роботи з дезінсекції
             проводяться цілодобово, у призначений вами час, з використанням препаратів IV класу
             малонебезпечних речовин (безпечних як для людей, так і тварин).`
      }
    }
  };

  return (
    <div className='divBodyPagesAboutUs'>
      <section>
        <h1>{translateObj.PagesDisinsection.title[currentLanguage]}</h1>
        <p>{translateObj.PagesDisinsection.text[currentLanguage]}</p>
      </section>
    </div>
  );
};

export default PagesDisinsection;
